<?php
define('STATIC_P', 'static_wrap');
require($_SERVER["DOCUMENT_ROOT"] . "/bitrix/header.php");
/**
 * @var CMain $APPLICATION
 */
$APPLICATION->SetTitle("Пользовательское соглашение");
?>

    <div id="o_nas" class="mb-5 static">
        <h3>Согласие Пользователя на сбор, обработку, хранение и использование своих персональных данных</h3>
        <p>Настоящим я, далее – «Субъект Персональных Данных», «Пользователь», во исполнение требований Федерального закона от
            27.07.2006 г. № 152-ФЗ «О персональных данных» (с изменениями и дополнениями) свободно, своей волей и в своем
            интересе даю свое согласие ООО «Смак - Султана», Адрес местонахождения: 127642, Москва, пр-д Шокальского, д. 6А -129
            ИНН 7715441408 ОГРН 1147746917053, (далее – «Интернет-магазин», Оператор персональных данных, Продавец) на сбор,
            обработку, хранение и использование своих персональных данных, указанных при регистрации, путем заполнения любых
            веб-форм, бланков заказа на сайте Интернет-магазина https://oshisha.net (далее – Сайт/Интернет магазин),
            направляемых (заполненных) с использованием Сайта на условиях указанных в настоящем согласии.</p>
        <p>Предоставляя свои персональные данные даю свое согласие на обработку, хранение и использование своих персональных
            данных на основании ФЗ № 152-ФЗ «О персональных данных» от 27.07.2006 г., то есть на совершение всех действий,
            предусмотренных п. 3 ст. 3 Федерального закона от 27.07.2006 N 152-ФЗ "О персональных данных", в следующих
            целях:</p>
        <p>- Предоставления Пользователю доступа к отдельным ресурсам Сайта.</p>
        <p>- Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования
            Сайта, оказания услуг, обработка запросов и заказов от Пользователя.</p>
        <p>- Получения Пользователем информации о маркетинговых событиях.</p>
        <p>- Выполнение обязательств Продавца перед Покупателем: в части формирования, исполнения Заказов через Сайт (Интернет –
            магазин Сайта), заключение договоров поставки, оформление и передачу товаросопроводительных документов на
            поставляемый товар.</p>
        </p>- Проведения аудита и прочих внутренних исследований с целью повышения качества предоставляемых услуг/товаров.</p>
        </p>- Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.</p>
        </p>- Создания учетной записи на Сайте, регистрации Пользователя на Сайте.</p>
        </p>- Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем, связанных с использованием Сайта, заказа Товара.</p>
        </p>- Участия Пользователя в рекламных мероприятиях.</p>
        </p>- Информирование и предоставление доступа Пользователю на сайты или сервисы партнеров организации с целью получения продуктов, обновлений и услуг.</p>
        </p>- Информирования Пользователя о Продуктах и мероприятиях, путем отправки Пользователю рассылок, уведомлений. Также в целях информирования Пользователя путем уведомлений, рассылок о новых продуктах/товарах, услугах, специальных предложениях и различных событиях.</p>
        <p>- Идентификации/авторизации Пользователя на сайте Интернет-магазина, для оформления заказа и (или) заключения
            Договора поставки.</p>
        <p>- Предоставления Пользователю доступа к персонализированным ресурсам Сайта интернет-магазина.</p>
        <p>- Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.</p>
        <p>- Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.</p>
        <p>- Уведомления Пользователя Сайта интернет-магазина о состоянии Заказа.</p>
        <p>- Обработки и получения платежей, подтверждения налога или налоговых льгот, оспаривания платежа, определения права на
            получение кредитной линии Пользователем.</p>
        <p>Обезличенные данные Пользователей, собираемые с помощью сервиса интернет-статистики, служат для сбора информации о
            действиях Пользователей на сайте, улучшения качества Сайта и его содержания.</p>
        <p>Под персональными данными подразумевается любая информация личного характера, позволяющая установить личность
            Пользователя/Покупателя такая как:</p>
        <p>- фамилия, имя, отчество уполномоченного Пользователя;</p>
        <p>- контактный телефон уполномоченного Пользователя;</p>
        <p>- адрес электронной почты (e-mail) уполномоченного Пользователя;</p>
        <p>- дата рождения Пользователя;</p>
        <p>- адрес Пользователя для доставки Товара;</p>
        <p>- наименование, ОГРН, ИНН, адрес Пользователя;</p>
        <p>- реквизиты для выставления счёта Пользователя.</p>
        <p>Также на Сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов cookie) с помощью
            сервисов интернет-статистики. Предоставляя свое согласие на сбор и обработку персональных данных, Пользователь дает
            согласие на использование файлов cookie.</p>
        <p>Обработка персональных данных Субъекта Персональных Данных может осуществляться с помощью средств автоматизации и/или
            без использования средств автоматизации в соответствии с действующим законодательством РФ и внутренними положениями
            Интернет-магазина.</p>
        <h5>Компания (Оператор) обязуется не передавать полученные персональные данные третьим лицам, за исключением следующих
            случаев:</h5>
        <p>● По запросам уполномоченных органов государственной власти РФ только по основаниям и в порядке, установленным
            законодательством РФ.</p>
        <p>● Передачи персональных данных стратегическим партнерам, которые работают с Компанией (Оператором) для предоставления
            продуктов и услуг, или тем из них, которые помогают Компании реализовывать продукты, товары и услуги, а также
            информирование о новых продуктах, товарах, услугах и мероприятиях. Мы предоставляем третьим лицам минимальный объем
            персональных данных, необходимый только для оказания требуемой услуги или проведения необходимой транзакции.</p>
        <p>Пользователь соглашается с тем, что Администрация сайта вправе передавать персональные данные третьим лицам, в
            частности, курьерским службам, транспортным компаниям/перевозчикам, курьерам и организациями почтовой связи,
            операторам электросвязи, исключительно в целях выполнения обязательств по Договору и выполнения заказа Пользователя,
            оформленного на Сайте интернет-магазина https://oshisha.net, включая доставку Товара.</p>
        <h5>Настоящим Пользователь выражает свое согласие на:</h5>
        <p>• Выполнение действий по сбору и обработке персональных данных, как Компанией, так и третьими лицами –
            стратегическими партнерами, которым Компания передает персональные данные для выполнения целей, указанных в
            настоящем согласии, а именно: запись, систематизация, накопление, хранение, уточнение (обновление, изменение),
            извлечение, использование, передача (предоставление, доступ), обезличивание, блокирование, удаление, уничтожение
            персональных данных;</p>
        <p>• Электронные рассылки, создание сегментов персональных данных Пользователя, анализ персональных данных Пользователя,
            проведение маркетинговых кампаний: получение сообщений рекламного, информационного, маркетингового или любого
            другого характера, отправляемых через третьих лиц, с которыми у Компании (Оператора) заключен договор и которым
            Компания (Оператор) передает персональные данные, для целей указанных в настоящем согласии.</p>
        <p>• Получение от Компании (Оператора) (либо третьих лиц, с которыми у компании заключен договор) информационных
            материалов, путем осуществления прямых контактов с использованием всех средств связи, включая, но не ограничиваясь:
            почтовая рассылка, СМС-рассылка, голосовая рассылка, рассылка электронных писем.</p>
        <p>• Предоставлением персональных данных третьим лицам, в частности, курьерским службам, курьерам, транспортным
            компаниям, организациями почтовой связи, операторам электросвязи, исключительно в целях выполнения заказа
            Пользователя (Субъекта персональных данных), оформленного на Сайте интернет-магазина https://oshisha.net, включая
            доставку Товара.</p>
        <p>В ходе обработки с персональными данными будут совершены следующие действия: сбор; запись; систематизация;
            накопление; хранение; уточнение (обновление, изменение); извлечение; использование; передача (распространение,
            предоставление, доступ); блокирование; удаление; уничтожение, в том числе через третьих лиц – партнеров Оператора,
            для целей указанных в настоящем согласии.</p>
        <p>Персональные данные обрабатываются до прекращения всех обязательств по заключенному Договору, либо до отписки
            Пользователя от рекламных и новостных, информационных рассылок и сообщений, а также до отзыва субъекта персональных
            данных своего согласия, либо в течение 5 (пяти) лет с даты предоставления согласия (в зависимости от того, какой
            момент наступит раннее). Хранение персональных данных, зафиксированных на бумажных носителях, осуществляется
            согласно Федеральному закону No125-ФЗ «Об архивном деле в Российской Федерации» и иным нормативно-правовым актам в
            области архивного дела и архивного хранения.</p>
        <p>Пользователь, его уполномоченный представитель, всегда может отказаться от получения информационных сообщений,
            рекламных рассылок либо отозвать настоящее согласие, направив Оператору соответствующее уведомление в письменном
            виде по адресу нахождения Оператора: 127642, Москва, пр-д Шокальского, д. 6А -129 ИНН 7715441408 ОГРН 1147746917053,
            либо через Сайт с помощью Обратной связи с пометкой «Отзыв согласия на обработку персональных данных».</p>
        <p>В случае отзыва субъектом персональных данных или его представителем согласия на обработку персональных данных
            Оператор вправе продолжить обработку персональных данных без согласия субъекта персональных данных при наличии
            оснований, указанных в пунктах 2 – 11 части 1 статьи 6, части 2 статьи 10 и части 2 статьи 11 Федерального закона
            No152-ФЗ «О персональных данных» от 27.07.2006 г.</p>
        <p>Сайт, на котором осуществляется обработка персональных данных https://oshisha.net</p>
        <p>Согласие Пользователя на обработку персональных данных осуществляется на условиях ПОЛОЖЕНИЯ О СБОРЕ, ХРАНЕНИИ,
            ОБРАБОТКЕ И ЗАЩИТЕ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЕЙ САЙТА (ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ).</p>
        <p>Проставлением веб-отметки напротив графы: "Я согласен на обработку моих персональных данных на условиях Политики
            конфиденциальности и принимаю их", Пользователь подтверждает свое ознакомление с Политикой Сайта о персональных
            данных, выражает свое согласие на условия изложенные в ПОЛОЖЕНИИ О СБОРЕ,
            ХРАНЕНИИ, ОБРАБОТКЕ И ЗАЩИТЕ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЕЙ САЙТА (ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ) и предоставляет
    свое согласие на обработку Оператором персональных данных Пользователя на условиях ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ.</p>
    </div>
<?php require($_SERVER["DOCUMENT_ROOT"] . "/bitrix/footer.php");