<p>Плагин заполняет тестовые поля и свойства товара значениями, сгенерированными по шаблону.</p>
<p>При настройке шаблона доступен как ручной ввод текста, так и вставка макросов (напр., «<code><b>{=this.Name}</b></code>»). Макросы выбираются из выпадающего списка и вставляются в место курсора в текстовом поле.</p>
<p>Пример шаблона:<br/><code><b>Купить «{=this.Name}» в нашем магазине!</b></code>.</p>
<p>Плагин использует тот же механизм, который используется в SEO-шаблонах (хотя, и с другим оформлением), поэтому работа функциаонала должна быть абсолютно идентичной.</p>
