<?php
$MESS ['ENTEREGO_PVZ_SDEK_tarif_1_NAME']    = "Экспресс лайт дверь-дверь";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_1_DESCR']   = "Классическая экспресс-доставка по России документов и грузов до 30 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_3_NAME']    = "Супер-экспресс до 18";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_3_DESCR']   = "Срочная доставка документов и грузов «из рук в руки» по России к определенному часу.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_5_NAME']    = "Экономичный экспресс склад-склад";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_5_DESCR']   = "Недорогая доставка грузов по России ЖД и автотранспортом (доставка грузов с увеличением сроков).";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_10_NAME']   = "Экспресс лайт склад-склад";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_10_DESCR']  = "Классическая экспресс-доставка по России документов и грузов до 30 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_11_NAME']   = "Экспресс лайт склад-дверь";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_11_DESCR']  = "Классическая экспресс-доставка по России документов и грузов до 30 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_12_NAME']   = "Экспресс лайт дверь-склад";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_12_DESCR']  = "Классическая экспресс-доставка по России документов и грузов до 30 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_15_NAME']   = "Экспресс тяжеловесы склад-склад";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_15_DESCR']  = "Классическая экспресс-доставка по России документов и грузов от 30 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_16_NAME']   = "Экспресс тяжеловесы склад-дверь";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_16_DESCR']  = "Классическая экспресс-доставка по России документов и грузов от 30 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_17_NAME']   = "Экспресс тяжеловесы дверь-склад";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_17_DESCR']  = "Классическая экспресс-доставка по России документов и грузов от 30 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_18_NAME']   = "Экспресс тяжеловесы дверь-дверь";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_18_DESCR']  = "Классическая экспресс-доставка по России документов и грузов от 30 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_57_NAME']   = "Супер-экспресс до 9";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_57_DESCR']  = "Срочная доставка документов и грузов «из рук в руки» по России к определенному часу (доставка за 1-2 суток) до 5 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_58_NAME']   = "Супер-экспресс до 10";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_58_DESCR']  = "Срочная доставка документов и грузов «из рук в руки» по России к определенному часу (доставка за 1-2 суток) до 5 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_59_NAME']   = "Супер-экспресс до 12";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_59_DESCR']  = "Срочная доставка документов и грузов «из рук в руки» по России к определенному часу (доставка за 1-2 суток) до 5 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_60_NAME']   = "Супер-экспресс до 14";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_60_DESCR']  = "Срочная доставка документов и грузов «из рук в руки» по России к определенному часу (доставка за 1-2 суток) до 5 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_61_NAME']   = "Супер-экспресс до 16";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_61_DESCR']  = "Срочная доставка документов и грузов «из рук в руки» по России к определенному часу (доставка за 1-2 суток).";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_62_NAME']   = "Магистральный экспресс склад-склад";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_62_DESCR']  = "Быстрая экономичная доставка грузов по России.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_63_NAME']   = "Магистральный супер-экспресс склад-склад";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_63_DESCR']  = "Быстрая экономичная доставка грузов к определенному часу.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_83_NAME']   = "Блиц-экспресс";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_83_DESCR']  = "";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_136_NAME']  = "Посылка склад-склад (самовывоз)";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_136_DESCR'] = "Услуга экономичной доставки товаров по России для компаний, осуществляющих дистанционную торговлю до 30 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_137_NAME']  = "Посылка склад-дверь (курьер)";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_137_DESCR'] = "Услуга экономичной доставки товаров по России для компаний, осуществляющих дистанционную торговлю до 30 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_138_NAME']  = "Посылка дверь-склад";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_138_DESCR'] = "Услуга экономичной доставки товаров по России для компаний, осуществляющих дистанционную торговлю до 30 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_139_NAME']  = "Посылка дверь-дверь";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_139_DESCR'] = "Услуга экономичной доставки товаров по России для компаний, осуществляющих дистанционную торговлю до 30 кг.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_233_NAME']  = "Экономичная посылка склад-дверь";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_233_DESCR'] = "Услуга экономичной наземной доставки товаров по России для компаний, осуществляющих дистанционную торговлю, до 50 кг.<br>
Услуга действует по направлениям из Москвы в подразделения СДЭК, находящиеся за Уралом и в Крым.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_234_NAME']  = "Экономичная посылка склад-склад";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_234_DESCR'] = "Услуга экономичной наземной доставки товаров по России для компаний, осуществляющих дистанционную торговлю, до 50 кг.<br>
Услуга действует по направлениям из Москвы в подразделения СДЭК, находящиеся за Уралом и в Крым.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_480_NAME']  = "Экспресс дверь-дверь";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_480_DESCR'] = "Классическая экспресс-доставка документов и грузов по стандартным срокам доставки. Без ограничений по весу. <br><br>
Действует внутри страны и по направлениям между странами таможенного союза (Россия, Беларусь, Казахстан).";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_481_NAME']  = "Экспресс дверь-склад";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_481_DESCR'] = "Классическая экспресс-доставка документов и грузов по стандартным срокам доставки. Без ограничений по весу. <br><br>
Действует внутри страны и по направлениям между странами таможенного союза (Россия, Беларусь, Казахстан).";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_482_NAME']  = "Экспресс склад-дверь";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_482_DESCR'] = "Классическая экспресс-доставка документов и грузов по стандартным срокам доставки. Без ограничений по весу. <br><br>
Действует внутри страны и по направлениям между странами таможенного союза (Россия, Беларусь, Казахстан).";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_483_NAME']  = "Экспресс склад-склад";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_483_DESCR'] = "Классическая экспресс-доставка документов и грузов по стандартным срокам доставки. Без ограничений по весу. <br><br>
Действует внутри страны и по направлениям между странами таможенного союза (Россия, Беларусь, Казахстан).";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_485_NAME']  = "Экспресс дверь-постамат";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_485_DESCR'] = "Классическая экспресс-доставка документов и грузов по стандартным срокам доставки. Без ограничений по весу. <br><br>
Действует внутри страны и по направлениям между странами таможенного союза (Россия, Беларусь, Казахстан).";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_486_NAME']  = "Экспресс склад-постамат";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_486_DESCR'] = "Классическая экспресс-доставка документов и грузов по стандартным срокам доставки. Без ограничений по весу. <br><br>
Действует внутри страны и по направлениям между странами таможенного союза (Россия, Беларусь, Казахстан).";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_361_NAME']  = "Экспресс лайт дверь-постамат";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_361_DESCR'] = "Услуга доставки товаров по России с использованием постаматов.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_363_NAME']  = "Экспресс лайт склад-постамат";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_363_DESCR'] = "Услуга доставки товаров по России с использованием постаматов.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_366_NAME']  = "Посылка дверь-постамат";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_366_DESCR'] = "Услуга доставки товаров по России с использованием постаматов.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_368_NAME']  = "Посылка склад-постамат";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_368_DESCR'] = "Услуга доставки товаров по России с использованием постаматов.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_376_NAME']  = "Экономичная посылка дверь-постамат";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_376_DESCR'] = "Услуга доставки товаров по России с использованием постаматов.";

$MESS ['ENTEREGO_PVZ_SDEK_tarif_378_NAME']  = "Экономичная посылка склад-постамат";
$MESS ['ENTEREGO_PVZ_SDEK_tarif_378_DESCR'] = "Услуга доставки товаров по России с использованием постаматов.";
