<?php
define('STATIC_P', 'static_wrap');
require($_SERVER["DOCUMENT_ROOT"] . "/bitrix/header.php");
/**
 * @var CMain $APPLICATION
 */
$APPLICATION->SetTitle("Политика обработки cookies");
?>

    <div id="o_nas" class="mb-5 static">
        <h1>Политика обработки файлов cookie</h1>
        <p>Посещая сайт ООО "СМАК-СУЛТАНА" в сети «Интернет», вы соглашаетесь с настоящей политикой, в том числе с тем, что ООО "СМАК-СУЛТАНА" может использовать файлы cookie и иные данные для их последующей обработки системами Google Analytics, Яндекс.Метрика и др., а также может передавать их третьим лицам для проведения исследований, выполнения работ или оказания услуг.</p>
        <h3>Что такое файлы cookie</h3>
        <p>Файлы cookie – текстовые файлы небольшого размера, которые сохраняются на вашем устройстве (персональном компьютере, ноутбуке, планшете, мобильном телефоне и т.п.), когда вы посещаете сайты в сети «Интернет».</p>
        <p>Кроме того, при посещении сайта ООО "СМАК-СУЛТАНА" в сети «Интернет» происходит автоматический сбор иных данных, в том числе: технических характеристик устройства, IP-адреса, информации об используемом браузере и языке, даты и времени доступа к сайту, адресов запрашиваемых страниц сайта и иной подобной информации.</p>
        <h3>Какие виды файлов cookie используются</h3>
        <p>В зависимости от используемых вами браузера и устройства используются разные наборы файлов cookie, включающие в себя строго необходимые, эксплуатационные, функциональные и аналитические файлы cookie.</p>
        <h3>Для чего могут использоваться файлы cookie</h3>
        <p>При посещении вами сайта ООО "СМАК-СУЛТАНА" в сети «Интернет» файлы cookie могут использоваться для:</p>
        <p>• обеспечения функционирования и безопасности сайта;</p>
        <p>• улучшения качества сайта;</p>
        <p>• регистрации в системе самообслуживания (личном кабинете);</p>
        <p>• предоставлении вам информации о ООО "СМАК-СУЛТАНА", его продуктах и услугах;</p>
        <p>• усовершенствования продуктов и (или) услуг и для разработки новых продуктов и (или) услуг.</p>
        <p>Иная собираемая информация может быть использована для генерации вашего «списка интересов», состоящего из случайного идентификатора, категории интереса и отметки времени для демонстрации вам интернет-контента и рекламных объявлений, соответствующих вашим интересам.</p>
        <h3>Как управлять файлами cookie</h3>
        <p>Используемые вами браузер и (или) устройство могут позволять вам блокировать, удалять или иным образом ограничивать использование файлов cookie. Но файлы cookie являются важной частью сайта ООО "СМАК-СУЛТАНА" в сети «Интернет», поэтому блокировка, удаление или ограничение их использования может привести к тому, что вы будете иметь доступ не ко всем функциям сайта.</p>
        <p>Чтобы узнать, как управлять файлами cookie с помощью используемых вами браузера или устройства, вы можете воспользоваться инструкцией, предоставляемой разработчиком браузера или производителем устройства.</p>
    </div>
<?php require($_SERVER["DOCUMENT_ROOT"] . "/bitrix/footer.php");?>