<?php
$MESS ['PP_DS_INSTALL'] = 'Модуль интеграции с PickPoint установлен';

$MESS ['PP_DS_INSTALL_TEXT'] = "<strong>Перейдите, пожалуйста, на <a href='/bitrix/admin/settings.php?lang=ru&mid=pickpoint.deliveryservice&mid_menu=1' target='_blank'>страницу модуля</a> для его настройки. Там же размещена подробная документация.</strong>";

// Legacy
$MESS['WRITE_TO_INIT'] = 'автоматически добавить подключение модуля в init.php';
$MESS['MOD_NEXT_STEP'] = 'Далее';
$MESS['INSERT_SELF'] = "Внимание!\nДля корректной работы модуль должен быть инициализирован."
    ." По умолчанию подключение модуля автоматически добавляется в файл init.php.\n"
    ."Если Вы хотите самостоятельно определить место инициализации модуля, снимите галку."
    ." Там, где это необходимо, вставьте следующий код:\n#INTERFACE#";
