<p>Плагин для управления привязками элементов.</p>
<p>Доступны различные операции по управлению привязками:</p>
<ul>
	<li><b>Перенести в раздел</b> - элемент переносится в выбранный раздел, при этом все дополнительные привязки будут сброшены,</li>
	<li><b>Сменить основной раздел</b> - актуально когда элементы привязаны к нескольким разделам: в таком случае мы можем выбрать какой раздел будет считаться для него основным,</li>
	<li><b>Добавить привязку к разделу</b> - привязывает элементы к выбранному разделу (помимо уже имеющихся привязок),</li>
	<li><b>Удалить привязку к разделу</b> - отвязывает элемент от выбранного раздела (привязка к остальным разделам сохраняется).</li>
</ul>
