<?
$strLang = 'WDA_OPTIONS_';
$strHint = $strLang.'HINT_';

$MESS[$strLang.'OPTION_MANUAL'] = 'Настройки ручного запуска';
$MESS[$strLang.'OPTION_STEP_TIME'] = 'Время одного шага выполнения';
	$MESS[$strHint.'OPTION_STEP_TIME'] = 'Укажите время выполнения одного шага (в секундах). При большом кол-ве элементов/разделов, когда сам запрос занимает значительную часть времени, имеет смысл увеличить данное значение. При этом время выполнения шага нельзя устанавливать выше таймаутов сервера.';
$MESS[$strLang.'OPTION_SHOW_RESULTS'] = 'Показывать окно результатов выполнения обработки';
	$MESS[$strHint.'OPTION_SHOW_RESULTS'] = 'Выберите в каких случаях должно показываться всплывающее окно с результатами обработки.';
?>